zephyrproject-rtos/hal_nxp/dts/nxp/kinetis/MKV58F1M0VLQ24-pinctrl.h
/*
 * NOTE: Autogenerated file by kinetis_signal2dts.py
 *       for MKV58F1M0VLQ24/signal_configuration.xml
 *
 * Copyright (c) 2022, NXP
 * SPDX-License-Identifier: Apache-2.0
 */

#ifndef _ZEPHYR_DTS_BINDING_MKV58F1M0VLQ24_
#define _ZEPHYR_DTS_BINDING_MKV58F1M0VLQ24_

#define KINETIS_MUX(port, pin, mux)		\
	(((((port) - 'A') & 0xF) << 28) |	\
	(((pin) & 0x3F) << 22) |		\
	(((mux) & 0x7) << 8))

#define PTA0 KINETIS_MUX('A',0,1) /* PTA0 */
#define UART0_CTS_b_PTA0 KINETIS_MUX('A',0,2) /* PTA0 */
#define UART0_COL_b_PTA0 KINETIS_MUX('A',0,2) /* PTA0 */
#define FTM0_CH5_PTA0 KINETIS_MUX('A',0,3) /* PTA0 */
#define XB_IN4_PTA0 KINETIS_MUX('A',0,4) /* PTA0 */
#define XB_IN4_PTA0_PTA0_PTA0_PTA0 KINETIS_MUX('A',0,4) /* PTA0 */
#define XB_IN4/EWM_IN_PTA0_PTA0 KINETIS_MUX('A',0,4) /* PTA0 */
#define XB_IN4_PTA0_PTA0 KINETIS_MUX('A',0,4) /* PTA0 */
#define JTAG_TCLK_PTA0 KINETIS_MUX('A',0,7) /* PTA0 */
#define PTA1 KINETIS_MUX('A',1,1) /* PTA1 */
#define UART0_RX_PTA1 KINETIS_MUX('A',1,2) /* PTA1 */
#define FTM0_CH6_PTA1 KINETIS_MUX('A',1,3) /* PTA1 */
#define CMP0_OUT_PTA1 KINETIS_MUX('A',1,4) /* PTA1 */
#define FTM2_QD_PHA_PTA1 KINETIS_MUX('A',1,5) /* PTA1 */
#define FTM1_CH1_PTA1 KINETIS_MUX('A',1,6) /* PTA1 */
#define JTAG_TDI_PTA1 KINETIS_MUX('A',1,7) /* PTA1 */
#define PTA2 KINETIS_MUX('A',2,1) /* PTA2 */
#define UART0_TX_PTA2 KINETIS_MUX('A',2,2) /* PTA2 */
#define FTM0_CH7_PTA2 KINETIS_MUX('A',2,3) /* PTA2 */
#define CMP1_OUT_PTA2 KINETIS_MUX('A',2,4) /* PTA2 */
#define FTM2_QD_PHB_PTA2 KINETIS_MUX('A',2,5) /* PTA2 */
#define FTM1_CH0_PTA2 KINETIS_MUX('A',2,6) /* PTA2 */
#define JTAG_TDO_PTA2 KINETIS_MUX('A',2,7) /* PTA2 */
#define TRACE_SWO_PTA2 KINETIS_MUX('A',2,7) /* PTA2 */
#define PTA3 KINETIS_MUX('A',3,1) /* PTA3 */
#define UART0_RTS_b_PTA3 KINETIS_MUX('A',3,2) /* PTA3 */
#define FTM0_CH0_PTA3 KINETIS_MUX('A',3,3) /* PTA3 */
#define XB_IN9_PTA3_PTA3_PTA3_PTA3 KINETIS_MUX('A',3,4) /* PTA3 */
#define XB_IN9_PTA3 KINETIS_MUX('A',3,4) /* PTA3 */
#define XB_IN9_PTA3_PTA3 KINETIS_MUX('A',3,4) /* PTA3 */
#define EWM_OUT_b_PTA3 KINETIS_MUX('A',3,5) /* PTA3 */
#define FLEXPWM0_A0_PTA3 KINETIS_MUX('A',3,6) /* PTA3 */
#define JTAG_TMS_PTA3 KINETIS_MUX('A',3,7) /* PTA3 */
#define PTA4 KINETIS_MUX('A',4,1) /* PTA4 */
#define LLWU_P3_PTA4 KINETIS_MUX('A',4,1) /* PTA4 */
#define FTM0_CH1_PTA4 KINETIS_MUX('A',4,3) /* PTA4 */
#define XB_IN10_PTA4 KINETIS_MUX('A',4,4) /* PTA4 */
#define XB_IN10/FTM0_FLT3_PTA4_PTA4 KINETIS_MUX('A',4,4) /* PTA4 */
#define XB_IN10_PTA4_PTA4 KINETIS_MUX('A',4,4) /* PTA4 */
#define XB_IN10_PTA4_PTA4_PTA4_PTA4 KINETIS_MUX('A',4,4) /* PTA4 */
#define FLEXPWM0_B0_PTA4 KINETIS_MUX('A',4,6) /* PTA4 */
#define NMI_b_PTA4 KINETIS_MUX('A',4,7) /* PTA4 */
#define PTA5 KINETIS_MUX('A',5,1) /* PTA5 */
#define FTM0_CH2_PTA5 KINETIS_MUX('A',5,3) /* PTA5 */
#define MII0_RXER_PTA5 KINETIS_MUX('A',5,4) /* PTA5 */
#define RMII0_RXER_PTA5 KINETIS_MUX('A',5,4) /* PTA5 */
#define CMP2_OUT_PTA5 KINETIS_MUX('A',5,5) /* PTA5 */
#define JTAG_TRST_b_PTA5 KINETIS_MUX('A',5,7) /* PTA5 */
#define PTA6 KINETIS_MUX('A',6,1) /* PTA6 */
#define FTM0_CH3_PTA6 KINETIS_MUX('A',6,3) /* PTA6 */
#define CLKOUT_PTA6 KINETIS_MUX('A',6,5) /* PTA6 */
#define TRACE_CLKOUT_PTA6 KINETIS_MUX('A',6,7) /* PTA6 */
#define HSADC1B_CH8_PTA7 KINETIS_MUX('A',7,0) /* PTA7 */
#define PTA7 KINETIS_MUX('A',7,1) /* PTA7 */
#define FTM0_CH4_PTA7 KINETIS_MUX('A',7,3) /* PTA7 */
#define RMII0_MDIO_PTA7 KINETIS_MUX('A',7,5) /* PTA7 */
#define MII0_MDIO_PTA7 KINETIS_MUX('A',7,5) /* PTA7 */
#define TRACE_D3_PTA7 KINETIS_MUX('A',7,7) /* PTA7 */
#define HSADC1B_CH9_PTA8 KINETIS_MUX('A',8,0) /* PTA8 */
#define PTA8 KINETIS_MUX('A',8,1) /* PTA8 */
#define FTM1_CH0_PTA8 KINETIS_MUX('A',8,3) /* PTA8 */
#define MII0_MDC_PTA8 KINETIS_MUX('A',8,5) /* PTA8 */
#define RMII0_MDC_PTA8 KINETIS_MUX('A',8,5) /* PTA8 */
#define TRACE_D2_PTA8 KINETIS_MUX('A',8,7) /* PTA8 */
#define PTA9 KINETIS_MUX('A',9,1) /* PTA9 */
#define FTM1_CH1_PTA9 KINETIS_MUX('A',9,3) /* PTA9 */
#define MII0_RXD3_PTA9 KINETIS_MUX('A',9,5) /* PTA9 */
#define TRACE_D1_PTA9 KINETIS_MUX('A',9,7) /* PTA9 */
#define PTA10 KINETIS_MUX('A',10,1) /* PTA10 */
#define LLWU_P22_PTA10 KINETIS_MUX('A',10,1) /* PTA10 */
#define FTM2_CH0_PTA10 KINETIS_MUX('A',10,3) /* PTA10 */
#define MII0_RXD2_PTA10 KINETIS_MUX('A',10,5) /* PTA10 */
#define FTM2_QD_PHA_PTA10 KINETIS_MUX('A',10,6) /* PTA10 */
#define TRACE_D0_PTA10 KINETIS_MUX('A',10,7) /* PTA10 */
#define LLWU_P23_PTA11 KINETIS_MUX('A',11,1) /* PTA11 */
#define PTA11 KINETIS_MUX('A',11,1) /* PTA11 */
#define FTM2_CH1_PTA11 KINETIS_MUX('A',11,3) /* PTA11 */
#define MII0_RXCLK_PTA11 KINETIS_MUX('A',11,5) /* PTA11 */
#define FTM2_QD_PHB_PTA11 KINETIS_MUX('A',11,6) /* PTA11 */
#define I2C0_SDA_PTA11 KINETIS_MUX('A',11,8) /* PTA11 */
#define CMP2_IN0_PTA12 KINETIS_MUX('A',12,0) /* PTA12 */
#define PTA12 KINETIS_MUX('A',12,1) /* PTA12 */
#define CAN0_TX_PTA12 KINETIS_MUX('A',12,2) /* PTA12 */
#define FTM1_CH0_PTA12 KINETIS_MUX('A',12,3) /* PTA12 */
#define RMII0_RXD1_PTA12 KINETIS_MUX('A',12,5) /* PTA12 */
#define MII0_RXD1_PTA12 KINETIS_MUX('A',12,5) /* PTA12 */
#define FTM1_QD_PHA_PTA12 KINETIS_MUX('A',12,7) /* PTA12 */
#define I2C0_SCL_PTA12 KINETIS_MUX('A',12,8) /* PTA12 */
#define CMP2_IN1_PTA13 KINETIS_MUX('A',13,0) /* PTA13 */
#define PTA13 KINETIS_MUX('A',13,1) /* PTA13 */
#define LLWU_P4_PTA13 KINETIS_MUX('A',13,1) /* PTA13 */
#define CAN0_RX_PTA13 KINETIS_MUX('A',13,2) /* PTA13 */
#define FTM1_CH1_PTA13 KINETIS_MUX('A',13,3) /* PTA13 */
#define RMII0_RXD0_PTA13 KINETIS_MUX('A',13,5) /* PTA13 */
#define MII0_RXD0_PTA13 KINETIS_MUX('A',13,5) /* PTA13 */
#define FTM1_QD_PHB_PTA13 KINETIS_MUX('A',13,7) /* PTA13 */
#define I2C1_SDA_PTA13 KINETIS_MUX('A',13,8) /* PTA13 */
#define CMP3_IN0_PTA14 KINETIS_MUX('A',14,0) /* PTA14 */
#define PTA14 KINETIS_MUX('A',14,1) /* PTA14 */
#define SPI0_PCS0_PTA14 KINETIS_MUX('A',14,2) /* PTA14 */
#define UART0_TX_PTA14 KINETIS_MUX('A',14,3) /* PTA14 */
#define CAN2_TX_PTA14 KINETIS_MUX('A',14,4) /* PTA14 */
#define MII0_RXDV_PTA14 KINETIS_MUX('A',14,5) /* PTA14 */
#define RMII0_CRS_DV_PTA14 KINETIS_MUX('A',14,5) /* PTA14 */
#define I2C1_SCL_PTA14 KINETIS_MUX('A',14,8) /* PTA14 */
#define CMP3_IN1_PTA15 KINETIS_MUX('A',15,0) /* PTA15 */
#define PTA15 KINETIS_MUX('A',15,1) /* PTA15 */
#define SPI0_SCK_PTA15 KINETIS_MUX('A',15,2) /* PTA15 */
#define UART0_RX_PTA15 KINETIS_MUX('A',15,3) /* PTA15 */
#define CAN2_RX_PTA15 KINETIS_MUX('A',15,4) /* PTA15 */
#define RMII0_TXEN_PTA15 KINETIS_MUX('A',15,5) /* PTA15 */
#define MII0_TXEN_PTA15 KINETIS_MUX('A',15,5) /* PTA15 */
#define CMP3_IN2_PTA16 KINETIS_MUX('A',16,0) /* PTA16 */
#define PTA16 KINETIS_MUX('A',16,1) /* PTA16 */
#define SPI0_SOUT_PTA16 KINETIS_MUX('A',16,2) /* PTA16 */
#define UART0_COL_b_PTA16 KINETIS_MUX('A',16,3) /* PTA16 */
#define UART0_CTS_b_PTA16 KINETIS_MUX('A',16,3) /* PTA16 */
#define MII0_TXD0_PTA16 KINETIS_MUX('A',16,5) /* PTA16 */
#define RMII0_TXD0_PTA16 KINETIS_MUX('A',16,5) /* PTA16 */
#define HSADC0A_CH15_PTA17 KINETIS_MUX('A',17,0) /* PTA17 */
#define PTA17 KINETIS_MUX('A',17,1) /* PTA17 */
#define SPI0_SIN_PTA17 KINETIS_MUX('A',17,2) /* PTA17 */
#define UART0_RTS_b_PTA17 KINETIS_MUX('A',17,3) /* PTA17 */
#define MII0_TXD1_PTA17 KINETIS_MUX('A',17,5) /* PTA17 */
#define RMII0_TXD1_PTA17 KINETIS_MUX('A',17,5) /* PTA17 */
#define EXTAL0_PTA18 KINETIS_MUX('A',18,0) /* PTA18 */
#define PTA18 KINETIS_MUX('A',18,1) /* PTA18 */
#define XB_IN7_PTA18_PTA18_PTA18_PTA18 KINETIS_MUX('A',18,2) /* PTA18 */
#define XB_IN7_PTA18 KINETIS_MUX('A',18,2) /* PTA18 */
#define XB_IN7_PTA18_PTA18 KINETIS_MUX('A',18,2) /* PTA18 */
#define FTM0_FLT2_PTA18 KINETIS_MUX('A',18,3) /* PTA18 */
#define FTM_CLKIN0_PTA18 KINETIS_MUX('A',18,4) /* PTA18 */
#define XB_OUT8_PTA18 KINETIS_MUX('A',18,5) /* PTA18 */
#define FTM3_CH2_PTA18 KINETIS_MUX('A',18,6) /* PTA18 */
#define XTAL0_PTA19 KINETIS_MUX('A',19,0) /* PTA19 */
#define PTA19 KINETIS_MUX('A',19,1) /* PTA19 */
#define XB_IN8_PTA19_PTA19_PTA19_PTA19 KINETIS_MUX('A',19,2) /* PTA19 */
#define XB_IN8_PTA19 KINETIS_MUX('A',19,2) /* PTA19 */
#define XB_IN8/FTM1_FLT0_PTA19_PTA19 KINETIS_MUX('A',19,2) /* PTA19 */
#define XB_IN8_PTA19_PTA19 KINETIS_MUX('A',19,2) /* PTA19 */
#define FTM1_FLT0_PTA19 KINETIS_MUX('A',19,3) /* PTA19 */
#define FTM_CLKIN1_PTA19 KINETIS_MUX('A',19,4) /* PTA19 */
#define XB_OUT9_PTA19 KINETIS_MUX('A',19,5) /* PTA19 */
#define LPTMR0_ALT1_PTA19 KINETIS_MUX('A',19,6) /* PTA19 */
#define PTA24 KINETIS_MUX('A',24,1) /* PTA24 */
#define XB_IN4_PTA24_PTA24_PTA24_PTA24 KINETIS_MUX('A',24,2) /* PTA24 */
#define XB_IN4_PTA24_PTA24 KINETIS_MUX('A',24,2) /* PTA24 */
#define XB_IN4_PTA24 KINETIS_MUX('A',24,2) /* PTA24 */
#define MII0_TXD2_PTA24 KINETIS_MUX('A',24,5) /* PTA24 */
#define PTA25 KINETIS_MUX('A',25,1) /* PTA25 */
#define XB_IN5_PTA25_PTA25_PTA25_PTA25 KINETIS_MUX('A',25,2) /* PTA25 */
#define XB_IN5_PTA25 KINETIS_MUX('A',25,2) /* PTA25 */
#define XB_IN5_PTA25_PTA25 KINETIS_MUX('A',25,2) /* PTA25 */
#define MII0_TXCLK_PTA25 KINETIS_MUX('A',25,5) /* PTA25 */
#define PTA26 KINETIS_MUX('A',26,1) /* PTA26 */
#define MII0_TXD3_PTA26 KINETIS_MUX('A',26,5) /* PTA26 */
#define PTA27 KINETIS_MUX('A',27,1) /* PTA27 */
#define MII0_CRS_PTA27 KINETIS_MUX('A',27,5) /* PTA27 */
#define PTA28 KINETIS_MUX('A',28,1) /* PTA28 */
#define MII0_TXER_PTA28 KINETIS_MUX('A',28,5) /* PTA28 */
#define PTA29 KINETIS_MUX('A',29,1) /* PTA29 */
#define MII0_COL_PTA29 KINETIS_MUX('A',29,5) /* PTA29 */
#define HSADC0B_CH2_PTB0 KINETIS_MUX('B',0,0) /* PTB0 */
#define PTB0 KINETIS_MUX('B',0,1) /* PTB0 */
#define LLWU_P5_PTB0 KINETIS_MUX('B',0,1) /* PTB0 */
#define I2C0_SCL_PTB0 KINETIS_MUX('B',0,2) /* PTB0 */
#define FTM1_CH0_PTB0 KINETIS_MUX('B',0,3) /* PTB0 */
#define FTM1_QD_PHA_PTB0 KINETIS_MUX('B',0,6) /* PTB0 */
#define UART0_RX_PTB0 KINETIS_MUX('B',0,7) /* PTB0 */
#define MII0_MDIO_PTB0 KINETIS_MUX('B',0,8) /* PTB0 */
#define RMII0_MDIO_PTB0 KINETIS_MUX('B',0,8) /* PTB0 */
#define HSADC0B_CH3_PTB1 KINETIS_MUX('B',1,0) /* PTB1 */
#define PTB1 KINETIS_MUX('B',1,1) /* PTB1 */
#define I2C0_SDA_PTB1 KINETIS_MUX('B',1,2) /* PTB1 */
#define FTM1_CH1_PTB1 KINETIS_MUX('B',1,3) /* PTB1 */
#define FTM0_FLT2_PTB1 KINETIS_MUX('B',1,4) /* PTB1 */
#define EWM_IN_PTB1 KINETIS_MUX('B',1,5) /* PTB1 */
#define FTM1_QD_PHB_PTB1 KINETIS_MUX('B',1,6) /* PTB1 */
#define UART0_TX_PTB1 KINETIS_MUX('B',1,7) /* PTB1 */
#define RMII0_MDC_PTB1 KINETIS_MUX('B',1,8) /* PTB1 */
#define MII0_MDC_PTB1 KINETIS_MUX('B',1,8) /* PTB1 */
#define CMP2_IN2_PTB2 KINETIS_MUX('B',2,0) /* PTB2 */
#define HSADC0A_CH14_PTB2 KINETIS_MUX('B',2,0) /* PTB2 */
#define PTB2 KINETIS_MUX('B',2,1) /* PTB2 */
#define I2C0_SCL_PTB2 KINETIS_MUX('B',2,2) /* PTB2 */
#define UART0_RTS_b_PTB2 KINETIS_MUX('B',2,3) /* PTB2 */
#define FTM0_FLT1_PTB2 KINETIS_MUX('B',2,4) /* PTB2 */
#define ENET0_1588_TMR0_PTB2 KINETIS_MUX('B',2,5) /* PTB2 */
#define FTM0_FLT3_PTB2 KINETIS_MUX('B',2,6) /* PTB2 */
#define CMP3_IN5_PTB3 KINETIS_MUX('B',3,0) /* PTB3 */
#define HSADC0B_CH15_PTB3 KINETIS_MUX('B',3,0) /* PTB3 */
#define PTB3 KINETIS_MUX('B',3,1) /* PTB3 */
#define I2C0_SDA_PTB3 KINETIS_MUX('B',3,2) /* PTB3 */
#define UART0_COL_b_PTB3 KINETIS_MUX('B',3,3) /* PTB3 */
#define UART0_CTS_b_PTB3 KINETIS_MUX('B',3,3) /* PTB3 */
#define ENET0_1588_TMR1_PTB3 KINETIS_MUX('B',3,5) /* PTB3 */
#define FTM0_FLT0_PTB3 KINETIS_MUX('B',3,6) /* PTB3 */
#define ADC0_SE6b_PTB4 KINETIS_MUX('B',4,0) /* PTB4 */
#define PTB4 KINETIS_MUX('B',4,1) /* PTB4 */
#define FLEXPWM1_X0_PTB4 KINETIS_MUX('B',4,4) /* PTB4 */
#define ENET0_1588_TMR2_PTB4 KINETIS_MUX('B',4,5) /* PTB4 */
#define FTM1_FLT0_PTB4 KINETIS_MUX('B',4,6) /* PTB4 */
#define ADC0_SE7b_PTB5 KINETIS_MUX('B',5,0) /* PTB5 */
#define PTB5 KINETIS_MUX('B',5,1) /* PTB5 */
#define FLEXPWM1_X1_PTB5 KINETIS_MUX('B',5,4) /* PTB5 */
#define ENET0_1588_TMR3_PTB5 KINETIS_MUX('B',5,5) /* PTB5 */
#define FTM2_FLT0_PTB5 KINETIS_MUX('B',5,6) /* PTB5 */
#define HSADC1A_CH12_PTB6 KINETIS_MUX('B',6,0) /* PTB6 */
#define PTB6 KINETIS_MUX('B',6,1) /* PTB6 */
#define CAN2_TX_PTB6 KINETIS_MUX('B',6,2) /* PTB6 */
#define FLEXPWM1_X2_PTB6 KINETIS_MUX('B',6,4) /* PTB6 */
#define HSADC1A_CH13_PTB7 KINETIS_MUX('B',7,0) /* PTB7 */
#define PTB7 KINETIS_MUX('B',7,1) /* PTB7 */
#define CAN2_RX_PTB7 KINETIS_MUX('B',7,2) /* PTB7 */
#define FLEXPWM1_X3_PTB7 KINETIS_MUX('B',7,4) /* PTB7 */
#define PTB8 KINETIS_MUX('B',8,1) /* PTB8 */
#define UART3_RTS_b_PTB8 KINETIS_MUX('B',8,3) /* PTB8 */
#define PTB9 KINETIS_MUX('B',9,1) /* PTB9 */
#define SPI1_PCS1_PTB9 KINETIS_MUX('B',9,2) /* PTB9 */
#define UART3_CTS_b_PTB9 KINETIS_MUX('B',9,3) /* PTB9 */
#define ENET0_1588_TMR2_PTB9 KINETIS_MUX('B',9,5) /* PTB9 */
#define HSADC0B_CH6_PTB10 KINETIS_MUX('B',10,0) /* PTB10 */
#define PTB10 KINETIS_MUX('B',10,1) /* PTB10 */
#define SPI1_PCS0_PTB10 KINETIS_MUX('B',10,2) /* PTB10 */
#define UART3_RX_PTB10 KINETIS_MUX('B',10,3) /* PTB10 */
#define ENET0_1588_TMR3_PTB10 KINETIS_MUX('B',10,5) /* PTB10 */
#define FTM0_FLT1_PTB10 KINETIS_MUX('B',10,6) /* PTB10 */
#define HSADC0B_CH7_PTB11 KINETIS_MUX('B',11,0) /* PTB11 */
#define PTB11 KINETIS_MUX('B',11,1) /* PTB11 */
#define SPI1_SCK_PTB11 KINETIS_MUX('B',11,2) /* PTB11 */
#define UART3_TX_PTB11 KINETIS_MUX('B',11,3) /* PTB11 */
#define FTM0_FLT2_PTB11 KINETIS_MUX('B',11,6) /* PTB11 */
#define PTB16 KINETIS_MUX('B',16,1) /* PTB16 */
#define SPI1_SOUT_PTB16 KINETIS_MUX('B',16,2) /* PTB16 */
#define UART0_RX_PTB16 KINETIS_MUX('B',16,3) /* PTB16 */
#define FTM_CLKIN2_PTB16 KINETIS_MUX('B',16,4) /* PTB16 */
#define CAN0_TX_PTB16 KINETIS_MUX('B',16,5) /* PTB16 */
#define XB_IN5_PTB16_PTB16 KINETIS_MUX('B',16,7) /* PTB16 */
#define EWM_IN/XB_IN5_PTB16_PTB16 KINETIS_MUX('B',16,7) /* PTB16 */
#define XB_IN5_PTB16 KINETIS_MUX('B',16,7) /* PTB16 */
#define XB_IN5_PTB16_PTB16_PTB16_PTB16 KINETIS_MUX('B',16,7) /* PTB16 */
#define PTB17 KINETIS_MUX('B',17,1) /* PTB17 */
#define SPI1_SIN_PTB17 KINETIS_MUX('B',17,2) /* PTB17 */
#define UART0_TX_PTB17 KINETIS_MUX('B',17,3) /* PTB17 */
#define FTM_CLKIN1_PTB17 KINETIS_MUX('B',17,4) /* PTB17 */
#define CAN0_RX_PTB17 KINETIS_MUX('B',17,5) /* PTB17 */
#define EWM_OUT_b_PTB17 KINETIS_MUX('B',17,6) /* PTB17 */
#define PTB18 KINETIS_MUX('B',18,1) /* PTB18 */
#define CAN0_TX_PTB18 KINETIS_MUX('B',18,2) /* PTB18 */
#define FTM2_CH0_PTB18 KINETIS_MUX('B',18,3) /* PTB18 */
#define FTM3_CH2_PTB18 KINETIS_MUX('B',18,4) /* PTB18 */
#define FLEXPWM1_A1_PTB18 KINETIS_MUX('B',18,5) /* PTB18 */
#define FTM2_QD_PHA_PTB18 KINETIS_MUX('B',18,6) /* PTB18 */
#define PTB19 KINETIS_MUX('B',19,1) /* PTB19 */
#define CAN0_RX_PTB19 KINETIS_MUX('B',19,2) /* PTB19 */
#define FTM2_CH1_PTB19 KINETIS_MUX('B',19,3) /* PTB19 */
#define FTM3_CH3_PTB19 KINETIS_MUX('B',19,4) /* PTB19 */
#define FLEXPWM1_B1_PTB19 KINETIS_MUX('B',19,5) /* PTB19 */
#define FTM2_QD_PHB_PTB19 KINETIS_MUX('B',19,6) /* PTB19 */
#define PTB20 KINETIS_MUX('B',20,1) /* PTB20 */
#define SPI2_PCS0_PTB20 KINETIS_MUX('B',20,2) /* PTB20 */
#define FLEXPWM0_X0_PTB20 KINETIS_MUX('B',20,5) /* PTB20 */
#define CMP0_OUT_PTB20 KINETIS_MUX('B',20,6) /* PTB20 */
#define PTB21 KINETIS_MUX('B',21,1) /* PTB21 */
#define SPI2_SCK_PTB21 KINETIS_MUX('B',21,2) /* PTB21 */
#define FLEXPWM0_X1_PTB21 KINETIS_MUX('B',21,5) /* PTB21 */
#define CMP1_OUT_PTB21 KINETIS_MUX('B',21,6) /* PTB21 */
#define PTB22 KINETIS_MUX('B',22,1) /* PTB22 */
#define SPI2_SOUT_PTB22 KINETIS_MUX('B',22,2) /* PTB22 */
#define FLEXPWM0_X2_PTB22 KINETIS_MUX('B',22,5) /* PTB22 */
#define CMP2_OUT_PTB22 KINETIS_MUX('B',22,6) /* PTB22 */
#define PTB23 KINETIS_MUX('B',23,1) /* PTB23 */
#define SPI2_SIN_PTB23 KINETIS_MUX('B',23,2) /* PTB23 */
#define SPI0_PCS5_PTB23 KINETIS_MUX('B',23,3) /* PTB23 */
#define FLEXPWM0_X3_PTB23 KINETIS_MUX('B',23,5) /* PTB23 */
#define CMP3_OUT_PTB23 KINETIS_MUX('B',23,6) /* PTB23 */
#define HSADC0B_CH8_PTC0 KINETIS_MUX('C',0,0) /* PTC0 */
#define PTC0 KINETIS_MUX('C',0,1) /* PTC0 */
#define SPI0_PCS4_PTC0 KINETIS_MUX('C',0,2) /* PTC0 */
#define PDB0_EXTRG_PTC0 KINETIS_MUX('C',0,3) /* PTC0 */
#define FTM0_FLT1_PTC0 KINETIS_MUX('C',0,6) /* PTC0 */
#define SPI0_PCS0_PTC0 KINETIS_MUX('C',0,7) /* PTC0 */
#define HSADC0B_CH9_PTC1 KINETIS_MUX('C',1,0) /* PTC1 */
#define PTC1 KINETIS_MUX('C',1,1) /* PTC1 */
#define LLWU_P6_PTC1 KINETIS_MUX('C',1,1) /* PTC1 */
#define SPI0_PCS3_PTC1 KINETIS_MUX('C',1,2) /* PTC1 */
#define UART1_RTS_b_PTC1 KINETIS_MUX('C',1,3) /* PTC1 */
#define FTM0_CH0_PTC1 KINETIS_MUX('C',1,4) /* PTC1 */
#define FLEXPWM0_A3_PTC1 KINETIS_MUX('C',1,5) /* PTC1 */
#define XB_IN11_PTC1_PTC1 KINETIS_MUX('C',1,6) /* PTC1 */
#define XB_IN11_PTC1 KINETIS_MUX('C',1,6) /* PTC1 */
#define XB_IN11_PTC1_PTC1_PTC1_PTC1 KINETIS_MUX('C',1,6) /* PTC1 */
#define HSADC1B_CH10_PTC2 KINETIS_MUX('C',2,0) /* PTC2 */
#define CMP1_IN0_PTC2 KINETIS_MUX('C',2,0) /* PTC2 */
#define PTC2 KINETIS_MUX('C',2,1) /* PTC2 */
#define SPI0_PCS2_PTC2 KINETIS_MUX('C',2,2) /* PTC2 */
#define UART1_CTS_b_PTC2 KINETIS_MUX('C',2,3) /* PTC2 */
#define FTM0_CH1_PTC2 KINETIS_MUX('C',2,4) /* PTC2 */
#define FLEXPWM0_B3_PTC2 KINETIS_MUX('C',2,5) /* PTC2 */
#define XB_IN6_PTC2 KINETIS_MUX('C',2,6) /* PTC2 */
#define XB_IN6_PTC2_PTC2 KINETIS_MUX('C',2,6) /* PTC2 */
#define XB_IN6_PTC2_PTC2_PTC2_PTC2 KINETIS_MUX('C',2,6) /* PTC2 */
#define CMP1_IN1_PTC3 KINETIS_MUX('C',3,0) /* PTC3 */
#define LLWU_P7_PTC3 KINETIS_MUX('C',3,1) /* PTC3 */
#define PTC3 KINETIS_MUX('C',3,1) /* PTC3 */
#define SPI0_PCS1_PTC3 KINETIS_MUX('C',3,2) /* PTC3 */
#define UART1_RX_PTC3 KINETIS_MUX('C',3,3) /* PTC3 */
#define FTM0_CH2_PTC3 KINETIS_MUX('C',3,4) /* PTC3 */
#define CLKOUT_PTC3 KINETIS_MUX('C',3,5) /* PTC3 */
#define FTM3_FLT0_PTC3 KINETIS_MUX('C',3,6) /* PTC3 */
#define PTC4 KINETIS_MUX('C',4,1) /* PTC4 */
#define LLWU_P8_PTC4 KINETIS_MUX('C',4,1) /* PTC4 */
#define SPI0_PCS0_PTC4 KINETIS_MUX('C',4,2) /* PTC4 */
#define UART1_TX_PTC4 KINETIS_MUX('C',4,3) /* PTC4 */
#define FTM0_CH3_PTC4 KINETIS_MUX('C',4,4) /* PTC4 */
#define CMP1_OUT_PTC4 KINETIS_MUX('C',4,6) /* PTC4 */
#define PTC5 KINETIS_MUX('C',5,1) /* PTC5 */
#define LLWU_P9_PTC5 KINETIS_MUX('C',5,1) /* PTC5 */
#define SPI0_SCK_PTC5 KINETIS_MUX('C',5,2) /* PTC5 */
#define LPTMR0_ALT2_PTC5 KINETIS_MUX('C',5,3) /* PTC5 */
#define XB_IN2_PTC5 KINETIS_MUX('C',5,4) /* PTC5 */
#define XB_IN2_PTC5_PTC5_PTC5_PTC5 KINETIS_MUX('C',5,4) /* PTC5 */
#define XB_IN2_PTC5_PTC5 KINETIS_MUX('C',5,4) /* PTC5 */
#define CMP0_OUT_PTC5 KINETIS_MUX('C',5,6) /* PTC5 */
#define FTM0_CH2_PTC5 KINETIS_MUX('C',5,7) /* PTC5 */
#define CMP2_IN4_PTC6 KINETIS_MUX('C',6,0) /* PTC6 */
#define CMP0_IN0_PTC6 KINETIS_MUX('C',6,0) /* PTC6 */
#define LLWU_P10_PTC6 KINETIS_MUX('C',6,1) /* PTC6 */
#define PTC6 KINETIS_MUX('C',6,1) /* PTC6 */
#define SPI0_SOUT_PTC6 KINETIS_MUX('C',6,2) /* PTC6 */
#define PDB0_EXTRG_PTC6 KINETIS_MUX('C',6,3) /* PTC6 */
#define PDB0_EXTRG/XB_IN3_PTC6_PTC6_PTC6 KINETIS_MUX('C',6,4) /* PTC6 */
#define XB_IN3_PTC6 KINETIS_MUX('C',6,4) /* PTC6 */
#define XB_IN3_PTC6_PTC6 KINETIS_MUX('C',6,4) /* PTC6 */
#define XB_IN3_PTC6_PTC6_PTC6_PTC6 KINETIS_MUX('C',6,4) /* PTC6 */
#define UART0_RX_PTC6 KINETIS_MUX('C',6,5) /* PTC6 */
#define XB_OUT6_PTC6 KINETIS_MUX('C',6,6) /* PTC6 */
#define I2C0_SCL_PTC6 KINETIS_MUX('C',6,7) /* PTC6 */
#define CMP3_IN4_PTC7 KINETIS_MUX('C',7,0) /* PTC7 */
#define CMP0_IN1_PTC7 KINETIS_MUX('C',7,0) /* PTC7 */
#define PTC7 KINETIS_MUX('C',7,1) /* PTC7 */
#define SPI0_SIN_PTC7 KINETIS_MUX('C',7,2) /* PTC7 */
#define XB_IN4_PTC7 KINETIS_MUX('C',7,4) /* PTC7 */
#define XB_IN4_PTC7_PTC7_PTC7_PTC7 KINETIS_MUX('C',7,4) /* PTC7 */
#define XB_IN4_PTC7_PTC7 KINETIS_MUX('C',7,4) /* PTC7 */
#define UART0_TX_PTC7 KINETIS_MUX('C',7,5) /* PTC7 */
#define XB_OUT7_PTC7 KINETIS_MUX('C',7,6) /* PTC7 */
#define I2C0_SDA_PTC7 KINETIS_MUX('C',7,7) /* PTC7 */
#define HSADC1B_CH11_PTC8 KINETIS_MUX('C',8,0) /* PTC8 */
#define CMP0_IN2_PTC8 KINETIS_MUX('C',8,0) /* PTC8 */
#define PTC8 KINETIS_MUX('C',8,1) /* PTC8 */
#define FTM3_CH4_PTC8 KINETIS_MUX('C',8,3) /* PTC8 */
#define FLEXPWM1_A2_PTC8 KINETIS_MUX('C',8,4) /* PTC8 */
#define HSADC1B_CH12_PTC9 KINETIS_MUX('C',9,0) /* PTC9 */
#define CMP0_IN3_PTC9 KINETIS_MUX('C',9,0) /* PTC9 */
#define PTC9 KINETIS_MUX('C',9,1) /* PTC9 */
#define FTM3_CH5_PTC9 KINETIS_MUX('C',9,3) /* PTC9 */
#define FLEXPWM1_B2_PTC9 KINETIS_MUX('C',9,4) /* PTC9 */
#define HSADC1B_CH13_PTC10 KINETIS_MUX('C',10,0) /* PTC10 */
#define PTC10 KINETIS_MUX('C',10,1) /* PTC10 */
#define I2C1_SCL_PTC10 KINETIS_MUX('C',10,2) /* PTC10 */
#define FTM3_CH6_PTC10 KINETIS_MUX('C',10,3) /* PTC10 */
#define FLEXPWM1_A3_PTC10 KINETIS_MUX('C',10,4) /* PTC10 */
#define HSADC1B_CH14_PTC11 KINETIS_MUX('C',11,0) /* PTC11 */
#define PTC11 KINETIS_MUX('C',11,1) /* PTC11 */
#define LLWU_P11_PTC11 KINETIS_MUX('C',11,1) /* PTC11 */
#define I2C1_SDA_PTC11 KINETIS_MUX('C',11,2) /* PTC11 */
#define FTM3_CH7_PTC11 KINETIS_MUX('C',11,3) /* PTC11 */
#define FLEXPWM1_B3_PTC11 KINETIS_MUX('C',11,4) /* PTC11 */
#define PTC12 KINETIS_MUX('C',12,1) /* PTC12 */
#define CAN2_TX_PTC12 KINETIS_MUX('C',12,2) /* PTC12 */
#define FTM_CLKIN0_PTC12 KINETIS_MUX('C',12,4) /* PTC12 */
#define FLEXPWM1_A1_PTC12 KINETIS_MUX('C',12,5) /* PTC12 */
#define FTM3_FLT0_PTC12 KINETIS_MUX('C',12,6) /* PTC12 */
#define SPI2_PCS1_PTC12 KINETIS_MUX('C',12,7) /* PTC12 */
#define UART4_RTS_b_PTC12 KINETIS_MUX('C',12,9) /* PTC12 */
#define PTC13 KINETIS_MUX('C',13,1) /* PTC13 */
#define CAN2_RX_PTC13 KINETIS_MUX('C',13,2) /* PTC13 */
#define FTM_CLKIN1_PTC13 KINETIS_MUX('C',13,4) /* PTC13 */
#define FLEXPWM1_B1_PTC13 KINETIS_MUX('C',13,5) /* PTC13 */
#define UART4_CTS_b_PTC13 KINETIS_MUX('C',13,9) /* PTC13 */
#define PTC14 KINETIS_MUX('C',14,1) /* PTC14 */
#define I2C1_SCL_PTC14 KINETIS_MUX('C',14,2) /* PTC14 */
#define I2C0_SCL_PTC14 KINETIS_MUX('C',14,3) /* PTC14 */
#define FLEXPWM1_A0_PTC14 KINETIS_MUX('C',14,5) /* PTC14 */
#define UART4_RX_PTC14 KINETIS_MUX('C',14,9) /* PTC14 */
#define PTC15 KINETIS_MUX('C',15,1) /* PTC15 */
#define I2C1_SDA_PTC15 KINETIS_MUX('C',15,2) /* PTC15 */
#define I2C0_SDA_PTC15 KINETIS_MUX('C',15,3) /* PTC15 */
#define FLEXPWM1_B0_PTC15 KINETIS_MUX('C',15,5) /* PTC15 */
#define UART4_TX_PTC15 KINETIS_MUX('C',15,9) /* PTC15 */
#define PTC16 KINETIS_MUX('C',16,1) /* PTC16 */
#define CAN1_RX_PTC16 KINETIS_MUX('C',16,2) /* PTC16 */
#define UART3_RX_PTC16 KINETIS_MUX('C',16,3) /* PTC16 */
#define ENET0_1588_TMR0_PTC16 KINETIS_MUX('C',16,4) /* PTC16 */
#define FLEXPWM1_A2_PTC16 KINETIS_MUX('C',16,5) /* PTC16 */
#define PTC17 KINETIS_MUX('C',17,1) /* PTC17 */
#define CAN1_TX_PTC17 KINETIS_MUX('C',17,2) /* PTC17 */
#define UART3_TX_PTC17 KINETIS_MUX('C',17,3) /* PTC17 */
#define ENET0_1588_TMR1_PTC17 KINETIS_MUX('C',17,4) /* PTC17 */
#define FLEXPWM1_B2_PTC17 KINETIS_MUX('C',17,5) /* PTC17 */
#define PTC18 KINETIS_MUX('C',18,1) /* PTC18 */
#define UART3_RTS_b_PTC18 KINETIS_MUX('C',18,3) /* PTC18 */
#define ENET0_1588_TMR2_PTC18 KINETIS_MUX('C',18,4) /* PTC18 */
#define FLEXPWM1_A3_PTC18 KINETIS_MUX('C',18,5) /* PTC18 */
#define PTC19 KINETIS_MUX('C',19,1) /* PTC19 */
#define UART3_CTS_b_PTC19 KINETIS_MUX('C',19,3) /* PTC19 */
#define ENET0_1588_TMR3_PTC19 KINETIS_MUX('C',19,4) /* PTC19 */
#define FLEXPWM1_B3_PTC19 KINETIS_MUX('C',19,5) /* PTC19 */
#define PTD0 KINETIS_MUX('D',0,1) /* PTD0 */
#define LLWU_P12_PTD0 KINETIS_MUX('D',0,1) /* PTD0 */
#define SPI0_PCS0_PTD0 KINETIS_MUX('D',0,2) /* PTD0 */
#define UART2_RTS_b_PTD0 KINETIS_MUX('D',0,3) /* PTD0 */
#define FTM3_CH0_PTD0 KINETIS_MUX('D',0,4) /* PTD0 */
#define FTM0_CH0_PTD0 KINETIS_MUX('D',0,5) /* PTD0 */
#define FLEXPWM0_A0_PTD0 KINETIS_MUX('D',0,6) /* PTD0 */
#define FLEXPWM1_A0_PTD0 KINETIS_MUX('D',0,9) /* PTD0 */
#define HSADC1A_CH11_PTD1 KINETIS_MUX('D',1,0) /* PTD1 */
#define PTD1 KINETIS_MUX('D',1,1) /* PTD1 */
#define SPI0_SCK_PTD1 KINETIS_MUX('D',1,2) /* PTD1 */
#define UART2_CTS_b_PTD1 KINETIS_MUX('D',1,3) /* PTD1 */
#define FTM3_CH1_PTD1 KINETIS_MUX('D',1,4) /* PTD1 */
#define FTM0_CH1_PTD1 KINETIS_MUX('D',1,5) /* PTD1 */
#define FLEXPWM0_B0_PTD1 KINETIS_MUX('D',1,6) /* PTD1 */
#define FLEXPWM1_B0_PTD1 KINETIS_MUX('D',1,9) /* PTD1 */
