zephyrproject-rtos/hal_nxp/dts/nxp/kinetis/MKV58F1M0VLQ24-pinctrl.h
#define LLWU_P13_PTD2 KINETIS_MUX('D',2,1) /* PTD2 */
#define PTD2 KINETIS_MUX('D',2,1) /* PTD2 */
#define SPI0_SOUT_PTD2 KINETIS_MUX('D',2,2) /* PTD2 */
#define UART2_RX_PTD2 KINETIS_MUX('D',2,3) /* PTD2 */
#define FTM3_CH2_PTD2 KINETIS_MUX('D',2,4) /* PTD2 */
#define FTM0_CH2_PTD2 KINETIS_MUX('D',2,5) /* PTD2 */
#define FLEXPWM0_A1_PTD2 KINETIS_MUX('D',2,6) /* PTD2 */
#define I2C0_SCL_PTD2 KINETIS_MUX('D',2,7) /* PTD2 */
#define FLEXPWM1_A1_PTD2 KINETIS_MUX('D',2,9) /* PTD2 */
#define PTD3 KINETIS_MUX('D',3,1) /* PTD3 */
#define SPI0_SIN_PTD3 KINETIS_MUX('D',3,2) /* PTD3 */
#define UART2_TX_PTD3 KINETIS_MUX('D',3,3) /* PTD3 */
#define FTM3_CH3_PTD3 KINETIS_MUX('D',3,4) /* PTD3 */
#define FTM0_CH3_PTD3 KINETIS_MUX('D',3,5) /* PTD3 */
#define FLEXPWM0_B1_PTD3 KINETIS_MUX('D',3,6) /* PTD3 */
#define I2C0_SDA_PTD3 KINETIS_MUX('D',3,7) /* PTD3 */
#define FLEXPWM1_B1_PTD3 KINETIS_MUX('D',3,9) /* PTD3 */
#define LLWU_P14_PTD4 KINETIS_MUX('D',4,1) /* PTD4 */
#define PTD4 KINETIS_MUX('D',4,1) /* PTD4 */
#define SPI0_PCS1_PTD4 KINETIS_MUX('D',4,2) /* PTD4 */
#define UART0_RTS_b_PTD4 KINETIS_MUX('D',4,3) /* PTD4 */
#define FTM0_CH4_PTD4 KINETIS_MUX('D',4,4) /* PTD4 */
#define FLEXPWM0_A2_PTD4 KINETIS_MUX('D',4,5) /* PTD4 */
#define EWM_IN_PTD4 KINETIS_MUX('D',4,6) /* PTD4 */
#define SPI1_PCS0_PTD4 KINETIS_MUX('D',4,7) /* PTD4 */
#define HSADC1A_CH8_PTD5 KINETIS_MUX('D',5,0) /* PTD5 */
#define PTD5 KINETIS_MUX('D',5,1) /* PTD5 */
#define SPI0_PCS2_PTD5 KINETIS_MUX('D',5,2) /* PTD5 */
#define UART0_CTS_b_PTD5 KINETIS_MUX('D',5,3) /* PTD5 */
#define UART0_COL_b_PTD5 KINETIS_MUX('D',5,3) /* PTD5 */
#define FTM0_CH5_PTD5 KINETIS_MUX('D',5,4) /* PTD5 */
#define FLEXPWM0_B2_PTD5 KINETIS_MUX('D',5,5) /* PTD5 */
#define EWM_OUT_b_PTD5 KINETIS_MUX('D',5,6) /* PTD5 */
#define SPI1_SCK_PTD5 KINETIS_MUX('D',5,7) /* PTD5 */
#define HSADC1A_CH9_PTD6 KINETIS_MUX('D',6,0) /* PTD6 */
#define PTD6 KINETIS_MUX('D',6,1) /* PTD6 */
#define LLWU_P15_PTD6 KINETIS_MUX('D',6,1) /* PTD6 */
#define SPI0_PCS3_PTD6 KINETIS_MUX('D',6,2) /* PTD6 */
#define UART0_RX_PTD6 KINETIS_MUX('D',6,3) /* PTD6 */
#define FTM0_CH6_PTD6 KINETIS_MUX('D',6,4) /* PTD6 */
#define FTM1_CH0_PTD6 KINETIS_MUX('D',6,5) /* PTD6 */
#define FTM0_FLT0_PTD6 KINETIS_MUX('D',6,6) /* PTD6 */
#define SPI1_SOUT_PTD6 KINETIS_MUX('D',6,7) /* PTD6 */
#define PTD7 KINETIS_MUX('D',7,1) /* PTD7 */
#define UART0_TX_PTD7 KINETIS_MUX('D',7,3) /* PTD7 */
#define FTM0_CH7_PTD7 KINETIS_MUX('D',7,4) /* PTD7 */
#define FTM1_CH1_PTD7 KINETIS_MUX('D',7,5) /* PTD7 */
#define FTM0_FLT1_PTD7 KINETIS_MUX('D',7,6) /* PTD7 */
#define SPI1_SIN_PTD7 KINETIS_MUX('D',7,7) /* PTD7 */
#define LLWU_P24_PTD8 KINETIS_MUX('D',8,1) /* PTD8 */
#define PTD8 KINETIS_MUX('D',8,1) /* PTD8 */
#define I2C1_SCL_PTD8 KINETIS_MUX('D',8,2) /* PTD8 */
#define UART5_RX_PTD8 KINETIS_MUX('D',8,3) /* PTD8 */
#define FLEXPWM0_A3_PTD8 KINETIS_MUX('D',8,6) /* PTD8 */
#define PTD9 KINETIS_MUX('D',9,1) /* PTD9 */
#define I2C1_SDA_PTD9 KINETIS_MUX('D',9,2) /* PTD9 */
#define UART5_TX_PTD9 KINETIS_MUX('D',9,3) /* PTD9 */
#define FLEXPWM0_B3_PTD9 KINETIS_MUX('D',9,6) /* PTD9 */
#define PTD10 KINETIS_MUX('D',10,1) /* PTD10 */
#define UART5_RTS_b_PTD10 KINETIS_MUX('D',10,3) /* PTD10 */
#define FLEXPWM0_A2_PTD10 KINETIS_MUX('D',10,6) /* PTD10 */
#define PTD11 KINETIS_MUX('D',11,1) /* PTD11 */
#define LLWU_P25_PTD11 KINETIS_MUX('D',11,1) /* PTD11 */
#define SPI2_PCS0_PTD11 KINETIS_MUX('D',11,2) /* PTD11 */
#define UART5_CTS_b_PTD11 KINETIS_MUX('D',11,3) /* PTD11 */
#define FLEXPWM0_B2_PTD11 KINETIS_MUX('D',11,6) /* PTD11 */
#define PTD12 KINETIS_MUX('D',12,1) /* PTD12 */
#define SPI2_SCK_PTD12 KINETIS_MUX('D',12,2) /* PTD12 */
#define FTM3_FLT0_PTD12 KINETIS_MUX('D',12,3) /* PTD12 */
#define XB_IN5_PTD12_PTD12 KINETIS_MUX('D',12,4) /* PTD12 */
#define XB_IN5_PTD12 KINETIS_MUX('D',12,4) /* PTD12 */
#define FTM3_FLT0/XB_IN5_PTD12_PTD12 KINETIS_MUX('D',12,4) /* PTD12 */
#define XB_IN5_PTD12_PTD12_PTD12_PTD12 KINETIS_MUX('D',12,4) /* PTD12 */
#define XB_OUT5_PTD12 KINETIS_MUX('D',12,5) /* PTD12 */
#define FLEXPWM0_A1_PTD12 KINETIS_MUX('D',12,6) /* PTD12 */
#define PTD13 KINETIS_MUX('D',13,1) /* PTD13 */
#define SPI2_SOUT_PTD13 KINETIS_MUX('D',13,2) /* PTD13 */
#define XB_IN7_PTD13_PTD13 KINETIS_MUX('D',13,4) /* PTD13 */
#define XB_IN7_PTD13 KINETIS_MUX('D',13,4) /* PTD13 */
#define XB_IN7_PTD13_PTD13_PTD13_PTD13 KINETIS_MUX('D',13,4) /* PTD13 */
#define XB_OUT7_PTD13 KINETIS_MUX('D',13,5) /* PTD13 */
#define FLEXPWM0_B1_PTD13 KINETIS_MUX('D',13,6) /* PTD13 */
#define PTD14 KINETIS_MUX('D',14,1) /* PTD14 */
#define SPI2_SIN_PTD14 KINETIS_MUX('D',14,2) /* PTD14 */
#define XB_IN11_PTD14_PTD14_PTD14_PTD14 KINETIS_MUX('D',14,4) /* PTD14 */
#define XB_IN11_PTD14 KINETIS_MUX('D',14,4) /* PTD14 */
#define XB_IN11_PTD14_PTD14 KINETIS_MUX('D',14,4) /* PTD14 */
#define XB_OUT11_PTD14 KINETIS_MUX('D',14,5) /* PTD14 */
#define FLEXPWM0_A0_PTD14 KINETIS_MUX('D',14,6) /* PTD14 */
#define PTD15 KINETIS_MUX('D',15,1) /* PTD15 */
#define SPI2_PCS1_PTD15 KINETIS_MUX('D',15,2) /* PTD15 */
#define FLEXPWM0_B0_PTD15 KINETIS_MUX('D',15,6) /* PTD15 */
#define HSADC1A_CH0_PTE0 KINETIS_MUX('E',0,0) /* PTE0 */
#define HSADC0B_CH16_PTE0 KINETIS_MUX('E',0,0) /* PTE0 */
#define PTE0 KINETIS_MUX('E',0,1) /* PTE0 */
#define SPI1_PCS1_PTE0 KINETIS_MUX('E',0,2) /* PTE0 */
#define UART1_TX_PTE0 KINETIS_MUX('E',0,3) /* PTE0 */
#define XB_OUT10_PTE0 KINETIS_MUX('E',0,4) /* PTE0 */
#define XB_IN11_PTE0 KINETIS_MUX('E',0,5) /* PTE0 */
#define XB_IN11_PTE0_PTE0_PTE0_PTE0 KINETIS_MUX('E',0,5) /* PTE0 */
#define XB_IN11_PTE0_PTE0 KINETIS_MUX('E',0,5) /* PTE0 */
#define I2C1_SDA_PTE0 KINETIS_MUX('E',0,6) /* PTE0 */
#define TRACE_CLKOUT_PTE0 KINETIS_MUX('E',0,8) /* PTE0 */
#define HSADC0B_CH17_PTE1 KINETIS_MUX('E',1,0) /* PTE1 */
#define HSADC1A_CH1_PTE1 KINETIS_MUX('E',1,0) /* PTE1 */
#define PTE1 KINETIS_MUX('E',1,1) /* PTE1 */
#define LLWU_P0_PTE1 KINETIS_MUX('E',1,1) /* PTE1 */
#define SPI1_SOUT_PTE1 KINETIS_MUX('E',1,2) /* PTE1 */
#define UART1_RX_PTE1 KINETIS_MUX('E',1,3) /* PTE1 */
#define XB_OUT11_PTE1 KINETIS_MUX('E',1,4) /* PTE1 */
#define XB_IN7_PTE1 KINETIS_MUX('E',1,5) /* PTE1 */
#define XB_IN7_PTE1_PTE1_PTE1_PTE1 KINETIS_MUX('E',1,5) /* PTE1 */
#define XB_IN7_PTE1_PTE1 KINETIS_MUX('E',1,5) /* PTE1 */
#define I2C1_SCL_PTE1 KINETIS_MUX('E',1,6) /* PTE1 */
#define TRACE_D3_PTE1 KINETIS_MUX('E',1,8) /* PTE1 */
#define HSADC1B_CH0_PTE2 KINETIS_MUX('E',2,0) /* PTE2 */
#define HSADC0B_CH10_PTE2 KINETIS_MUX('E',2,0) /* PTE2 */
#define LLWU_P1_PTE2 KINETIS_MUX('E',2,1) /* PTE2 */
#define PTE2 KINETIS_MUX('E',2,1) /* PTE2 */
#define SPI1_SCK_PTE2 KINETIS_MUX('E',2,2) /* PTE2 */
#define UART1_CTS_b_PTE2 KINETIS_MUX('E',2,3) /* PTE2 */
#define TRACE_D2_PTE2 KINETIS_MUX('E',2,8) /* PTE2 */
#define HSADC1B_CH1_PTE3 KINETIS_MUX('E',3,0) /* PTE3 */
#define HSADC0B_CH11_PTE3 KINETIS_MUX('E',3,0) /* PTE3 */
#define PTE3 KINETIS_MUX('E',3,1) /* PTE3 */
#define SPI1_SIN_PTE3 KINETIS_MUX('E',3,2) /* PTE3 */
#define UART1_RTS_b_PTE3 KINETIS_MUX('E',3,3) /* PTE3 */
#define TRACE_D1_PTE3 KINETIS_MUX('E',3,8) /* PTE3 */
#define ADC0_DP2_PTE4 KINETIS_MUX('E',4,0) /* PTE4 */
#define ADC0_SE2_PTE4 KINETIS_MUX('E',4,0) /* PTE4 */
#define HSADC1A_CH4_PTE4 KINETIS_MUX('E',4,0) /* PTE4 */
#define LLWU_P2_PTE4 KINETIS_MUX('E',4,1) /* PTE4 */
#define PTE4 KINETIS_MUX('E',4,1) /* PTE4 */
#define SPI1_PCS0_PTE4 KINETIS_MUX('E',4,2) /* PTE4 */
#define UART3_TX_PTE4 KINETIS_MUX('E',4,3) /* PTE4 */
#define TRACE_D0_PTE4 KINETIS_MUX('E',4,8) /* PTE4 */
#define ADC0_DM2_PTE5 KINETIS_MUX('E',5,0) /* PTE5 */
#define HSADC1A_CH5_PTE5 KINETIS_MUX('E',5,0) /* PTE5 */
#define ADC0_SE10_PTE5 KINETIS_MUX('E',5,0) /* PTE5 */
#define PTE5 KINETIS_MUX('E',5,1) /* PTE5 */
#define SPI1_PCS2_PTE5 KINETIS_MUX('E',5,2) /* PTE5 */
#define UART3_RX_PTE5 KINETIS_MUX('E',5,3) /* PTE5 */
#define FLEXPWM1_A0_PTE5 KINETIS_MUX('E',5,5) /* PTE5 */
#define FTM3_CH0_PTE5 KINETIS_MUX('E',5,6) /* PTE5 */
#define HSADC1B_CH7_PTE6 KINETIS_MUX('E',6,0) /* PTE6 */
#define ADC0_SE4a_PTE6 KINETIS_MUX('E',6,0) /* PTE6 */
#define PTE6 KINETIS_MUX('E',6,1) /* PTE6 */
#define LLWU_P16_PTE6 KINETIS_MUX('E',6,1) /* PTE6 */
#define SPI1_PCS3_PTE6 KINETIS_MUX('E',6,2) /* PTE6 */
#define UART3_CTS_b_PTE6 KINETIS_MUX('E',6,3) /* PTE6 */
#define FLEXPWM1_B0_PTE6 KINETIS_MUX('E',6,5) /* PTE6 */
#define FTM3_CH1_PTE6 KINETIS_MUX('E',6,6) /* PTE6 */
#define PTE7 KINETIS_MUX('E',7,1) /* PTE7 */
#define UART3_RTS_b_PTE7 KINETIS_MUX('E',7,3) /* PTE7 */
#define FLEXPWM1_A1_PTE7 KINETIS_MUX('E',7,5) /* PTE7 */
#define FTM3_CH2_PTE7 KINETIS_MUX('E',7,6) /* PTE7 */
#define PTE8 KINETIS_MUX('E',8,1) /* PTE8 */
#define UART5_TX_PTE8 KINETIS_MUX('E',8,3) /* PTE8 */
#define FLEXPWM1_B1_PTE8 KINETIS_MUX('E',8,5) /* PTE8 */
#define FTM3_CH3_PTE8 KINETIS_MUX('E',8,6) /* PTE8 */
#define PTE9 KINETIS_MUX('E',9,1) /* PTE9 */
#define LLWU_P17_PTE9 KINETIS_MUX('E',9,1) /* PTE9 */
#define UART5_RX_PTE9 KINETIS_MUX('E',9,3) /* PTE9 */
#define FLEXPWM1_A2_PTE9 KINETIS_MUX('E',9,5) /* PTE9 */
#define FTM3_CH4_PTE9 KINETIS_MUX('E',9,6) /* PTE9 */
#define LLWU_P18_PTE10 KINETIS_MUX('E',10,1) /* PTE10 */
#define PTE10 KINETIS_MUX('E',10,1) /* PTE10 */
#define UART5_CTS_b_PTE10 KINETIS_MUX('E',10,3) /* PTE10 */
#define FLEXPWM1_B2_PTE10 KINETIS_MUX('E',10,5) /* PTE10 */
#define FTM3_CH5_PTE10 KINETIS_MUX('E',10,6) /* PTE10 */
#define ADC0_DP3_PTE11 KINETIS_MUX('E',11,0) /* PTE11 */
#define ADC0_SE3_PTE11 KINETIS_MUX('E',11,0) /* PTE11 */
#define HSADC1A_CH6_PTE11 KINETIS_MUX('E',11,0) /* PTE11 */
#define PTE11 KINETIS_MUX('E',11,1) /* PTE11 */
#define UART5_RTS_b_PTE11 KINETIS_MUX('E',11,3) /* PTE11 */
#define FLEXPWM1_A3_PTE11 KINETIS_MUX('E',11,5) /* PTE11 */
#define FTM3_CH6_PTE11 KINETIS_MUX('E',11,6) /* PTE11 */
#define HSADC1B_CH6_PTE12 KINETIS_MUX('E',12,0) /* PTE12 */
#define ADC0_SE11_PTE12 KINETIS_MUX('E',12,0) /* PTE12 */
#define ADC0_DM3_PTE12 KINETIS_MUX('E',12,0) /* PTE12 */
#define PTE12 KINETIS_MUX('E',12,1) /* PTE12 */
#define FLEXPWM1_B3_PTE12 KINETIS_MUX('E',12,5) /* PTE12 */
#define FTM3_CH7_PTE12 KINETIS_MUX('E',12,6) /* PTE12 */
#define PTE13 KINETIS_MUX('E',13,1) /* PTE13 */
#define ADC0_DP1_PTE16 KINETIS_MUX('E',16,0) /* PTE16 */
#define ADC0_SE1_PTE16 KINETIS_MUX('E',16,0) /* PTE16 */
#define HSADC0A_CH0_PTE16 KINETIS_MUX('E',16,0) /* PTE16 */
#define PTE16 KINETIS_MUX('E',16,1) /* PTE16 */
#define SPI0_PCS0_PTE16 KINETIS_MUX('E',16,2) /* PTE16 */
#define UART2_TX_PTE16 KINETIS_MUX('E',16,3) /* PTE16 */
#define FTM_CLKIN0_PTE16 KINETIS_MUX('E',16,4) /* PTE16 */
#define FTM0_FLT3_PTE16 KINETIS_MUX('E',16,6) /* PTE16 */
#define HSADC0A_CH1_PTE17 KINETIS_MUX('E',17,0) /* PTE17 */
#define ADC0_DM1_PTE17 KINETIS_MUX('E',17,0) /* PTE17 */
#define ADC0_SE9_PTE17 KINETIS_MUX('E',17,0) /* PTE17 */
#define LLWU_P19_PTE17 KINETIS_MUX('E',17,1) /* PTE17 */
#define PTE17 KINETIS_MUX('E',17,1) /* PTE17 */
#define SPI0_SCK_PTE17 KINETIS_MUX('E',17,2) /* PTE17 */
#define UART2_RX_PTE17 KINETIS_MUX('E',17,3) /* PTE17 */
#define FTM_CLKIN1_PTE17 KINETIS_MUX('E',17,4) /* PTE17 */
#define LPTMR0_ALT3_PTE17 KINETIS_MUX('E',17,6) /* PTE17 */
#define HSADC0B_CH0_PTE18 KINETIS_MUX('E',18,0) /* PTE18 */
#define ADC0_SE5a_PTE18 KINETIS_MUX('E',18,0) /* PTE18 */
#define LLWU_P20_PTE18 KINETIS_MUX('E',18,1) /* PTE18 */
#define PTE18 KINETIS_MUX('E',18,1) /* PTE18 */
#define SPI0_SOUT_PTE18 KINETIS_MUX('E',18,2) /* PTE18 */
#define UART2_CTS_b_PTE18 KINETIS_MUX('E',18,3) /* PTE18 */
#define I2C0_SDA_PTE18 KINETIS_MUX('E',18,4) /* PTE18 */
#define HSADC0B_CH1_PTE19 KINETIS_MUX('E',19,0) /* PTE19 */
#define ADC0_SE6a_PTE19 KINETIS_MUX('E',19,0) /* PTE19 */
#define PTE19 KINETIS_MUX('E',19,1) /* PTE19 */
#define SPI0_SIN_PTE19 KINETIS_MUX('E',19,2) /* PTE19 */
#define UART2_RTS_b_PTE19 KINETIS_MUX('E',19,3) /* PTE19 */
#define I2C0_SCL_PTE19 KINETIS_MUX('E',19,4) /* PTE19 */
#define CMP3_OUT_PTE19 KINETIS_MUX('E',19,6) /* PTE19 */
#define HSADC0A_CH8_PTE20 KINETIS_MUX('E',20,0) /* PTE20 */
#define ADC0_SE5b_PTE20 KINETIS_MUX('E',20,0) /* PTE20 */
#define PTE20 KINETIS_MUX('E',20,1) /* PTE20 */
#define FTM1_CH0_PTE20 KINETIS_MUX('E',20,3) /* PTE20 */
#define UART0_TX_PTE20 KINETIS_MUX('E',20,4) /* PTE20 */
#define FTM1_QD_PHA_PTE20 KINETIS_MUX('E',20,5) /* PTE20 */
#define HSADC0A_CH9_PTE21 KINETIS_MUX('E',21,0) /* PTE21 */
#define HSADC1A_CH7_PTE21 KINETIS_MUX('E',21,0) /* PTE21 */
#define PTE21 KINETIS_MUX('E',21,1) /* PTE21 */
#define XB_IN9_PTE21 KINETIS_MUX('E',21,2) /* PTE21 */
#define XB_IN9_PTE21_PTE21_PTE21_PTE21 KINETIS_MUX('E',21,2) /* PTE21 */
#define XB_IN9_PTE21_PTE21 KINETIS_MUX('E',21,2) /* PTE21 */
#define FTM1_CH1_PTE21 KINETIS_MUX('E',21,3) /* PTE21 */
#define UART0_RX_PTE21 KINETIS_MUX('E',21,4) /* PTE21 */
#define FTM1_QD_PHB_PTE21 KINETIS_MUX('E',21,5) /* PTE21 */
#define PTE22 KINETIS_MUX('E',22,1) /* PTE22 */
#define FTM2_CH0_PTE22 KINETIS_MUX('E',22,3) /* PTE22 */
#define XB_IN2_PTE22 KINETIS_MUX('E',22,4) /* PTE22 */
#define XB_IN2_PTE22_PTE22_PTE22_PTE22 KINETIS_MUX('E',22,4) /* PTE22 */
#define XB_IN2_PTE22_PTE22 KINETIS_MUX('E',22,4) /* PTE22 */
#define FTM2_QD_PHA_PTE22 KINETIS_MUX('E',22,5) /* PTE22 */
#define PTE23 KINETIS_MUX('E',23,1) /* PTE23 */
#define FTM2_CH1_PTE23 KINETIS_MUX('E',23,3) /* PTE23 */
#define XB_IN3_PTE23_PTE23 KINETIS_MUX('E',23,4) /* PTE23 */
#define XB_IN3_PTE23 KINETIS_MUX('E',23,4) /* PTE23 */
#define XB_IN3_PTE23_PTE23_PTE23_PTE23 KINETIS_MUX('E',23,4) /* PTE23 */
#define FTM2_QD_PHB_PTE23 KINETIS_MUX('E',23,5) /* PTE23 */
#define HSADC0B_CH4_PTE24 KINETIS_MUX('E',24,0) /* PTE24 */
#define HSADC1B_CH4_PTE24 KINETIS_MUX('E',24,0) /* PTE24 */
#define PTE24 KINETIS_MUX('E',24,1) /* PTE24 */
#define CAN1_TX_PTE24 KINETIS_MUX('E',24,2) /* PTE24 */
#define FTM0_CH0_PTE24 KINETIS_MUX('E',24,3) /* PTE24 */
#define XB_IN2_PTE24 KINETIS_MUX('E',24,4) /* PTE24 */
#define XB_IN2_PTE24_PTE24_PTE24_PTE24 KINETIS_MUX('E',24,4) /* PTE24 */
#define XB_IN2_PTE24_PTE24 KINETIS_MUX('E',24,4) /* PTE24 */
#define I2C0_SCL_PTE24 KINETIS_MUX('E',24,5) /* PTE24 */
#define EWM_OUT_b_PTE24 KINETIS_MUX('E',24,6) /* PTE24 */
#define XB_OUT4_PTE24 KINETIS_MUX('E',24,7) /* PTE24 */
#define UART4_TX_PTE24 KINETIS_MUX('E',24,8) /* PTE24 */
#define HSADC1B_CH5_PTE25 KINETIS_MUX('E',25,0) /* PTE25 */
#define HSADC0B_CH5_PTE25 KINETIS_MUX('E',25,0) /* PTE25 */
#define LLWU_P21_PTE25 KINETIS_MUX('E',25,1) /* PTE25 */
#define PTE25 KINETIS_MUX('E',25,1) /* PTE25 */
#define CAN1_RX_PTE25 KINETIS_MUX('E',25,2) /* PTE25 */
#define FTM0_CH1_PTE25 KINETIS_MUX('E',25,3) /* PTE25 */
#define XB_IN3_PTE25 KINETIS_MUX('E',25,4) /* PTE25 */
#define XB_IN3_PTE25_PTE25_PTE25_PTE25 KINETIS_MUX('E',25,4) /* PTE25 */
#define XB_IN3_PTE25_PTE25 KINETIS_MUX('E',25,4) /* PTE25 */
#define XB_IN3/EWM_IN_PTE25_PTE25 KINETIS_MUX('E',25,4) /* PTE25 */
#define I2C0_SDA_PTE25 KINETIS_MUX('E',25,5) /* PTE25 */
#define XB_OUT5_PTE25 KINETIS_MUX('E',25,7) /* PTE25 */
#define UART4_RX_PTE25 KINETIS_MUX('E',25,8) /* PTE25 */
#define PTE26 KINETIS_MUX('E',26,1) /* PTE26 */
#define ENET_1588_CLKIN_PTE26 KINETIS_MUX('E',26,2) /* PTE26 */
#define FTM0_CH4_PTE26 KINETIS_MUX('E',26,3) /* PTE26 */
#define UART4_CTS_b_PTE26 KINETIS_MUX('E',26,8) /* PTE26 */
#define PTE27 KINETIS_MUX('E',27,1) /* PTE27 */
#define CAN2_TX_PTE27 KINETIS_MUX('E',27,2) /* PTE27 */
#define UART4_RTS_b_PTE27 KINETIS_MUX('E',27,8) /* PTE27 */
#define PTE28 KINETIS_MUX('E',28,1) /* PTE28 */
#define CAN2_RX_PTE28 KINETIS_MUX('E',28,2) /* PTE28 */
#define CMP1_IN5_PTE29 KINETIS_MUX('E',29,0) /* PTE29 */
#define CMP0_IN5_PTE29 KINETIS_MUX('E',29,0) /* PTE29 */
#define HSADC0A_CH4_PTE29 KINETIS_MUX('E',29,0) /* PTE29 */
#define PTE29 KINETIS_MUX('E',29,1) /* PTE29 */
#define FTM0_CH2_PTE29 KINETIS_MUX('E',29,3) /* PTE29 */
#define FTM_CLKIN0_PTE29 KINETIS_MUX('E',29,5) /* PTE29 */
#define DAC0_OUT_PTE30 KINETIS_MUX('E',30,0) /* PTE30 */
#define HSADC0A_CH5_PTE30 KINETIS_MUX('E',30,0) /* PTE30 */
#define CMP1_IN3_PTE30 KINETIS_MUX('E',30,0) /* PTE30 */
#define PTE30 KINETIS_MUX('E',30,1) /* PTE30 */
#define FTM0_CH3_PTE30 KINETIS_MUX('E',30,3) /* PTE30 */
#define FTM_CLKIN1_PTE30 KINETIS_MUX('E',30,5) /* PTE30 */
#endif
